# -*- coding: utf-8 -*-
import pandas as pd

# データ（辞書型）
data = {
    '名前': ['西住みほ', '秋山優花里', '武部沙織'],
    '身長': [158, 157, 157]}

# インデックスラベル
index_data = ['車長', '装填手', '通信手']

# データフレームの初期化
df = pd.DataFrame(data, index=index_data)
print(df)
"""
        名前   身長
車長    西住みほ  158
装填手  秋山優花里  157
通信手   武部沙織  157
"""


# 行列入れ替えて表示
print(df.T)
"""
      車長    装填手   通信手
名前  西住みほ  秋山優花里  武部沙織
身長   158    157   157
"""

# 行の並べ替え（指定したインデックスラベルの順に）
df2 = df.reindex(['装填手', '通信手', '車長'])
print(df2)

"""
        名前   身長
装填手  秋山優花里  157
通信手   武部沙織  157
車長    西住みほ  158
"""

# ラベル（身長）でソート(False：降順、true：昇順)
df3 = df.sort_values('身長', ascending=True)
print(df3)

"""
        名前   身長
装填手  秋山優花里  157
通信手   武部沙織  157
車長    西住みほ  158
"""

# インデックスラベルでソート
df4 = df.sort_index(axis=1, ascending=False)
print(df4)
"""
      身長     名前
車長   158   西住みほ
装填手  157  秋山優花里
通信手  157   武部沙織
"""
